#ifndef UE4SS_SDK_ST_PlayerInfo_HPP
#define UE4SS_SDK_ST_PlayerInfo_HPP

#include "Unreal/FString.hpp"

struct FST_PlayerInfo
{
    RC::Unreal::FString id_5_ACEE325C40A82A6010DF82BF448FD0B6;   // 0x0000 (size: 0x10)
    RC::Unreal::FString zone_2_7A1ED7FA4276A703DD7058A44D2AF8DA; // 0x0010 (size: 0x10)
    int64_t location_x_24_A99B33C64A7E3258D121F292594BE28D;      // 0x0020 (size: 0x8)
    int64_t location_y_25_F92DA72B4567F3AC671650A509495255;      // 0x0028 (size: 0x8)
    int64_t location_z_26_656F85D54404D4616F640EB43F326BC1;      // 0x0030 (size: 0x8)
    int64_t rotation_x_27_5CCE14E84D032F45F387C7BAA7E80C63;      // 0x0038 (size: 0x8)
    int64_t rotation_y_28_C810F6EF4BA528713F570EA57644882C;      // 0x0040 (size: 0x8)
    int64_t rotation_z_29_CBFC70324216054968EAA7B1D823249C;      // 0x0048 (size: 0x8)
    int64_t scale_x_30_55A9DE384646D5352090B3BF5BADC83E;         // 0x0050 (size: 0x8)
    int64_t scale_y_31_8C45682E4A4B1A074EC88AB59FA732E2;         // 0x0058 (size: 0x8)
    int64_t scale_z_32_9D900BCF48CBE018B7FE6D942156FDA6;         // 0x0060 (size: 0x8)
}; // Size: 0x68

#endif
